#pragma once

// SpellBreak By Respecter (0.15.340) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SB_g3_structs.hpp"

namespace SpellSDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class g3.AutoTester
// 0x0008 (0x0030 - 0x0028)
class UAutoTester : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.AutoTester");
		return ptr;
	}


	void OnMatchChanged(EXMatchPhase To);
};


// Class g3.CallHelper
// 0x0000 (0x0028 - 0x0028)
class UCallHelper : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.CallHelper");
		return ptr;
	}

};


// Class g3.XActionMutator
// 0x0000 (0x0028 - 0x0028)
class UXActionMutator : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XActionMutator");
		return ptr;
	}


	void Mutate(class UXAction* Action);
};


// Class g3.GActionMutator_AttributeBased
// 0x0028 (0x0050 - 0x0028)
class UGActionMutator_AttributeBased : public UXActionMutator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	EGAttributeSource                                  AttributeSource;                                          // 0x0030(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	struct FGameplayTag                                Attribute;                                                // 0x0038(0x0008) (Edit, DisableEditOnInstance)
	int                                                AttributeIndex;                                           // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	class UClass*                                      AttributeSourceClass;                                     // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionMutator_AttributeBased");
		return ptr;
	}

};


// Class g3.GActionMutator_DurationAttributed
// 0x0000 (0x0050 - 0x0050)
class UGActionMutator_DurationAttributed : public UGActionMutator_AttributeBased
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionMutator_DurationAttributed");
		return ptr;
	}

};


// Class g3.GActionMutator_DurationScaleAttributed
// 0x0000 (0x0050 - 0x0050)
class UGActionMutator_DurationScaleAttributed : public UGActionMutator_AttributeBased
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionMutator_DurationScaleAttributed");
		return ptr;
	}

};


// Class g3.GActionMutator_NumAttackPointAttributed
// 0x0000 (0x0050 - 0x0050)
class UGActionMutator_NumAttackPointAttributed : public UGActionMutator_AttributeBased
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionMutator_NumAttackPointAttributed");
		return ptr;
	}

};


// Class g3.GActionMutator_SetEmoteMontage
// 0x0008 (0x0030 - 0x0028)
class UGActionMutator_SetEmoteMontage : public UXActionMutator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionMutator_SetEmoteMontage");
		return ptr;
	}

};


// Class g3.GActionMutator_SetReloadDuration
// 0x0018 (0x0040 - 0x0028)
class UGActionMutator_SetReloadDuration : public UXActionMutator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FXActionRelativeTime                        FirePoint;                                                // 0x0030(0x0010) (Edit, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionMutator_SetReloadDuration");
		return ptr;
	}

};


// Class g3.GActionMutator_WeaponHand
// 0x0038 (0x0060 - 0x0028)
class UGActionMutator_WeaponHand : public UXActionMutator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UAnimMontage*                                LeftHandMontage;                                          // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EXRangedAttackPayload                              LeftHandPayload;                                          // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	class UBlendSpaceBase*                             LeftHandAimingBlendspace;                                 // 0x0040(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LeftHandStartStanceAnim;                                  // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LeftHandHoldStanceAnim;                                   // 0x0050(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LeftHandCancelStanceAnim;                                 // 0x0058(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionMutator_WeaponHand");
		return ptr;
	}

};


// Class g3.XActionTransistor
// 0x0000 (0x0028 - 0x0028)
class UXActionTransistor : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XActionTransistor");
		return ptr;
	}


	class UXActionTrigger* GetOwnerTrigger();
	class UXActionTransistor* GetOwnerTransistor();
	class UClass* ChooseAction(const struct FXActionEventInfo& Event, class AActor** io_ActionOwner);
};


// Class g3.GActionTransistor_CheckSkillCanFire
// 0x0020 (0x0048 - 0x0028)
class UGActionTransistor_CheckSkillCanFire : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	int                                                SkillSlot;                                                // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class UXActionTransistor*                          CanFire;                                                  // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UXActionTransistor*                          CannotFire;                                               // 0x0040(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_CheckSkillCanFire");
		return ptr;
	}

};


// Class g3.GActionTransistor_CheckSkillValidTarget
// 0x0020 (0x0048 - 0x0028)
class UGActionTransistor_CheckSkillValidTarget : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	int                                                SkillSlot;                                                // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class UXActionTransistor*                          CanFire;                                                  // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UXActionTransistor*                          CannotFire;                                               // 0x0040(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_CheckSkillValidTarget");
		return ptr;
	}

};


// Class g3.GActionTransistor_CheckWeaponCanFire
// 0x0020 (0x0048 - 0x0028)
class UGActionTransistor_CheckWeaponCanFire : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	int                                                FireMode;                                                 // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class UXActionTransistor*                          CanFire;                                                  // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UXActionTransistor*                          CannotFire;                                               // 0x0040(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_CheckWeaponCanFire");
		return ptr;
	}

};


// Class g3.GActionTransistor_CheckWeaponCanMelee
// 0x0020 (0x0048 - 0x0028)
class UGActionTransistor_CheckWeaponCanMelee : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	int                                                MeleeMode;                                                // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class UXActionTransistor*                          CanMelee;                                                 // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UXActionTransistor*                          CannotMelee;                                              // 0x0040(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_CheckWeaponCanMelee");
		return ptr;
	}

};


// Class g3.GActionTransistor_CheckWeaponHand
// 0x0018 (0x0040 - 0x0028)
class UGActionTransistor_CheckWeaponHand : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UXActionTransistor*                          LeftHand;                                                 // 0x0030(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UXActionTransistor*                          RightHand;                                                // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_CheckWeaponHand");
		return ptr;
	}

};


// Class g3.GActionTransistor_CheckWeaponValidTarget
// 0x0020 (0x0048 - 0x0028)
class UGActionTransistor_CheckWeaponValidTarget : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	int                                                FireMode;                                                 // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class UXActionTransistor*                          CanFire;                                                  // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UXActionTransistor*                          CannotFire;                                               // 0x0040(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_CheckWeaponValidTarget");
		return ptr;
	}

};


// Class g3.GActionTransistor_FilterWeaponInput
// 0x0010 (0x0038 - 0x0028)
class UGActionTransistor_FilterWeaponInput : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UXActionTransistor*                          Then;                                                     // 0x0030(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_FilterWeaponInput");
		return ptr;
	}

};


// Class g3.GActionTransistor_ForwardActiveSignal
// 0x0028 (0x0050 - 0x0028)
class UGActionTransistor_ForwardActiveSignal : public UXActionTransistor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UXActionTransistor*                          Active;                                                   // 0x0030(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UXActionTransistor*                          Inactive;                                                 // 0x0038(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FGameplayTag                                RightSignal;                                              // 0x0040(0x0008) (Edit)
	struct FGameplayTag                                LeftSignal;                                               // 0x0048(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActionTransistor_ForwardActiveSignal");
		return ptr;
	}

};


// Class g3.XActionTriggerSource
// 0x0010 (0x0100 - 0x00F0)
class UXActionTriggerSource : public UActorComponent
{
public:
	TArray<class UXActionTrigger*>                     Triggers;                                                 // 0x00F0(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XActionTriggerSource");
		return ptr;
	}


	void UnregisterTriggers();
	void RegisterTriggers();
};


// Class g3.GActiveSkill
// 0x01F0 (0x02F0 - 0x0100)
class UGActiveSkill : public UXActionTriggerSource
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0100(0x0008) MISSED OFFSET
	struct FText                                       Name;                                                     // 0x0108(0x0018) (Edit, DisableEditOnInstance)
	struct FText                                       Description;                                              // 0x0120(0x0018) (Edit, DisableEditOnInstance)
	EGSkillIconType                                    Icon;                                                     // 0x0138(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0139(0x0007) MISSED OFFSET
	class UTexture2D*                                  IconTexture;                                              // 0x0140(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FXGameplayAttribute                         ManaCost;                                                 // 0x0148(0x0018) (Edit, Net, DisableEditOnInstance)
	struct FXGameplayAttribute                         CooldownDurationSeconds;                                  // 0x0160(0x0018) (Edit, Net, DisableEditOnInstance)
	bool                                               bAllowCooldownWhileActive;                                // 0x0178(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0179(0x0007) MISSED OFFSET
	struct FXGameplayAttribute                         NumCharges;                                               // 0x0180(0x0018) (Edit, Net, DisableEditOnInstance)
	struct FXGameplayAttribute                         MaxCharges;                                               // 0x0198(0x0018) (Edit, Net, DisableEditOnInstance)
	struct FXGameplayAttribute                         RechargeDamageThreshold;                                  // 0x01B0(0x0018) (Edit, DisableEditOnInstance)
	struct FXGameplayAttribute                         RechargeDamageTotal;                                      // 0x01C8(0x0018) (Edit, DisableEditOnInstance)
	class UClass*                                      AmmoType;                                                 // 0x01E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FXGameplayAttribute                         AmmoUsed;                                                 // 0x01E8(0x0018) (Edit, Net, DisableEditOnInstance)
	TArray<struct FXScaledEffectClass>                 CharacterEffects;                                         // 0x0200(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FXGameplayAttribute                         CharacterEffectScale;                                     // 0x0210(0x0018) (Edit, Net, DisableEditOnInstance)
	struct FXGameplayAttribute                         CharacterEffectDuration;                                  // 0x0228(0x0018) (Edit, Net, DisableEditOnInstance)
	bool                                               bRemoveEffectsOnSkillRemoval;                             // 0x0240(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRemoveEffectsOnRecast;                                   // 0x0241(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x0242(0x0006) MISSED OFFSET
	class UXGameplayEffectContainer*                   EffectContainer;                                          // 0x0248(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0250(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
	class UClass*                                      StartCue;                                                 // 0x0270(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bFireAndForgetStartCue;                                   // 0x0278(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bStartCueOwnerOnly;                                       // 0x0279(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x6];                                       // 0x027A(0x0006) MISSED OFFSET
	class UClass*                                      FireCue;                                                  // 0x0280(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bFireAndForgetFireCue;                                    // 0x0288(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bFireCueOwnerOnly;                                        // 0x0289(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x6];                                       // 0x028A(0x0006) MISSED OFFSET
	struct FXGameplayAttribute                         CooldownTimeLeft;                                         // 0x0290(0x0018) (Edit, Net, DisableEditOnInstance)
	float                                              EffectTimeLeft;                                           // 0x02A8(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x02AC(0x0004) MISSED OFFSET
	class UXGameplayEffect*                            AppliedEffect;                                            // 0x02B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FGActiveSkillLastFire                       LastStart;                                                // 0x02B8(0x0010) (Net, Transient)
	struct FGActiveSkillLastFire                       LastFire;                                                 // 0x02C8(0x0010) (Net, Transient)
	float                                              MidAirCooldownTime;                                       // 0x02D8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x02DC(0x0004) MISSED OFFSET
	TArray<class UXGameplayEffect*>                    AppliedEffects;                                           // 0x02E0(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GActiveSkill");
		return ptr;
	}


	void onRep_NumCharges(const struct FXGameplayAttribute& Prev);
	void onRep_LastStart();
	void onRep_LastFire();
	void onRep_EffectTimeLeft(float PrevTimeLeft);
};


// Class g3.XGameplayEffect
// 0x01C0 (0x01E8 - 0x0028)
class UXGameplayEffect : public UObject
{
public:
	struct FText                                       Name;                                                     // 0x0028(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FText                                       Description;                                              // 0x0040(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UTexture2D*                                  StatusIcon;                                               // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UClass*>                              ApplicationActionCues;                                    // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              ActivationActionCues;                                     // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              ActionCues;                                               // 0x0080(0x0010) (ZeroConstructor, Deprecated)
	class UClass*                                      RequiredClass;                                            // 0x0090(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ApplicationChance;                                        // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       Tags;                                                     // 0x00A0(0x0020) (Edit, DisableEditOnInstance)
	EXGameplayEffectApplicationType                    ApplicationType;                                          // 0x00C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00C1(0x0007) MISSED OFFSET
	TArray<struct FXAttributeModEffect>                ApplicationAttributeMods;                                 // 0x00C8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	float                                              DurationSeconds;                                          // 0x00D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET
	TArray<struct FXApplicationAttributeRequirement>   RemovalAttributeThresholds;                               // 0x00E0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UXGameplayEffectRequirements*>        ApplicationRequirements;                                  // 0x00F0(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UXGameplayEffectRequirements*>        ActivationRequirements;                                   // 0x0100(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FGameplayTagContainer                       ApplicationGrantedTags;                                   // 0x0110(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FGameplayTagContainer                       ActivationGrantedTags;                                    // 0x0130(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                               bContinuallyCheckRequirements;                            // 0x0150(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0151(0x0003) MISSED OFFSET
	float                                              Period;                                                   // 0x0154(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PeriodForgiveness;                                        // 0x0158(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bScalePeriodicModsOverDuration;                           // 0x015C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bScalePeriodicEffectsOverDuration;                        // 0x015D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPreservePeriodicInterval;                                // 0x015E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWaitUntilFirstPeriodBeforeEffect;                        // 0x015F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FXScaledEffectClass>                 PeriodicEffectsToApply;                                   // 0x0160(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FXAttributeModEffect>                PeriodicAttributeMods;                                    // 0x0170(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FXScaledEffectClass>                 DeactivationEffects;                                      // 0x0180(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	bool                                               bScaleDeactivationEffectsByEffectScale;                   // 0x0190(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0191(0x0007) MISSED OFFSET
	struct FXScaledEffectClass                         RemovalEffect;                                            // 0x0198(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                               bScaleRemovalEffectByEffectScale;                         // 0x01A8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x01A9(0x0007) MISSED OFFSET
	struct FGameplayTag                                StackingCategory;                                         // 0x01B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	EXGameplayEffectStackingBehavior                   StackingBehavior;                                         // 0x01B8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EXGameplayEffectAggregationPolicy                  AggregationPolicy;                                        // 0x01B9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x01BA(0x0002) MISSED OFFSET
	float                                              StackPriority;                                            // 0x01BC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PeriodTimeLeft;                                           // 0x01C0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsActive;                                                // 0x01C4(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0xB];                                       // 0x01C5(0x000B) MISSED OFFSET
	float                                              ServerTimeApplied;                                        // 0x01D0(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	float                                              AppliedScale;                                             // 0x01D4(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	float                                              AppliedDuration;                                          // 0x01D8(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x01DC(0x0004) MISSED OFFSET
	class UXGameplayEffectContainer*                   OwningContainer;                                          // 0x01E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XGameplayEffect");
		return ptr;
	}


	bool ShouldCancel(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	void PostAttributeModification(const struct FXGameplayEffectApplicationParams& EffectParams, const struct FGameplayTag& AttributeTag, int AttributeIndex, const struct FXAttributeMod& Mod, float PrevValue);
	void OnRemovedFor(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	void OnPreActivatedFor(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	void OnPeriodicApplicationFor(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	void OnDeactivatedFor(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	void OnAppliedFor(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	void OnActivatedFor(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	bool NeedsToMonitorAttributeChange();
	bool K2_ShouldCancel(const struct FXGameplayEffectApplicationParams& Params);
	void K2_OnRemoved(const struct FXGameplayEffectApplicationParams& Params);
	void K2_OnPreActivated(const struct FXGameplayEffectApplicationParams& Params);
	void K2_OnPeriodicApplication(const struct FXGameplayEffectApplicationParams& Params, float DeltaSeconds);
	void K2_OnDeactivated(const struct FXGameplayEffectApplicationParams& Params);
	void K2_OnApplied(const struct FXGameplayEffectApplicationParams& Params);
	void K2_OnActivated(const struct FXGameplayEffectApplicationParams& Params);
	bool IsActive();
	bool HasTag(const struct FGameplayTag& Tag, bool bMatchExact);
	class AXPlayerState* GetOwningPlayerState();
	class UXGameplayEffectContainer* GetOwningContainer();
	class AActor* GetOwningActor();
	float GetExpirationTime();
	float GetAttributeValue(const struct FGameplayTag& Attribute, int Index);
	float GetAppliedScale();
	bool CanBeApplied(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	bool CanBeActive(class UXGameplayEffectContainer* Container, const struct FXGameplayEffectApplicationParams& Params);
	void BindOnPlayerKilled(const struct FScriptDelegate& Callback);
	void BindOnPlayerFired(const struct FScriptDelegate& Callback);
	void BindOnPlayerDamaged(const struct FScriptDelegate& Callback);
	void BindOnEnemyKilled(const struct FScriptDelegate& Callback);
	void BindOnEnemyDamaged(const struct FScriptDelegate& Callback);
	void BindOnAnyPlayerKilled(const struct FScriptDelegate& Callback);
	void ApplyPermanentModToPlayerState(class AXPlayerState* PlayerState, const struct FXAttributeModEffect& Mod, float Scale);
	void ApplyPermanentModBasedOnAttribute(const struct FXAttributeModEffect& Mod, const struct FGameplayTag& BackingAttribute, float ModScale, float BackingAttributeScale);
	void ApplyPermanentMod(const struct FXAttributeModEffect& Mod, float Scale);
	void ApplyEffectToPlayerState(class AXPlayerState* PlayerState, const struct FXGameplayEffectApplicationParams& Params);
};


// Class g3.GAddDamageAdjustmentRuleEffect
// 0x0038 (0x0220 - 0x01E8)
class UGAddDamageAdjustmentRuleEffect : public UXGameplayEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01E8(0x0008) MISSED OFFSET
	TArray<class UGDamageAdjustmentRule*>              DamageAdjustmentRules;                                    // 0x01F0(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	bool                                               bScaleAdjustmentEffectsByEffectScale;                     // 0x0200(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0201(0x0007) MISSED OFFSET
	TArray<class UGDamageAdjustmentRule*>              AppliedAdjustmentRules;                                   // 0x0208(0x0010) (ExportObject, ZeroConstructor, Transient)
	bool                                               bEverActivated;                                           // 0x0218(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0219(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GAddDamageAdjustmentRuleEffect");
		return ptr;
	}

};


// Class g3.GAddDamageEventEffect
// 0x0020 (0x0208 - 0x01E8)
class UGAddDamageEventEffect : public UXGameplayEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01E8(0x0008) MISSED OFFSET
	TArray<struct FGDamageEventEffect>                 DamageEffectsToAdd;                                       // 0x01F0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bScaleDamageEffectsByEffectScale;                         // 0x0200(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRemoveDamageEffectsOnDeactivate;                         // 0x0201(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bEverActivated;                                           // 0x0202(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x0203(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GAddDamageEventEffect");
		return ptr;
	}

};


// Class g3.GAddSkillActivationEffect
// 0x0020 (0x0208 - 0x01E8)
class UGAddSkillActivationEffect : public UXGameplayEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01E8(0x0008) MISSED OFFSET
	TArray<struct FGSkillActivationEffect>             SkillActivationEffectsToAdd;                              // 0x01F0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bScaleSkillEffectsByEffectScale;                          // 0x0200(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0201(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GAddSkillActivationEffect");
		return ptr;
	}

};


// Class g3.XUserWidget
// 0x0008 (0x0210 - 0x0208)
class UXUserWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0208(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XUserWidget");
		return ptr;
	}


	void TickWidget(float DeltaTime);
	bool IsConstructed();
	void DestructWidget();
	void ConstructWidget();
};


// Class g3.GArmorBarWidget
// 0x0028 (0x0238 - 0x0210)
class UGArmorBarWidget : public UXUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0210(0x0008) MISSED OFFSET
	float                                              RecentLightDamageTimespan;                                // 0x0218(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RecentLightDamageAnimationDuration;                       // 0x021C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RecentLightDamageAnimationEaseExponent;                   // 0x0220(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RecentHeavyDamageTimespan;                                // 0x0224(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RecentHeavyDamageAnimationDuration;                       // 0x0228(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RecentHeavyDamageAnimationEaseExponent;                   // 0x022C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class AGCharacter*                                 LastCharacter;                                            // 0x0230(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GArmorBarWidget");
		return ptr;
	}


	void TickWidget_Implementation(float DeltaTime);
};


// Class g3.XDataPropsComponent
// 0x0000 (0x00F0 - 0x00F0)
class UXDataPropsComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XDataPropsComponent");
		return ptr;
	}

};


// Class g3.XItemComponent
// 0x0098 (0x0188 - 0x00F0)
class UXItemComponent : public UXDataPropsComponent
{
public:
	struct FText                                       Name;                                                     // 0x00F0(0x0018) (Deprecated)
	class UClass*                                      SourceItemClass;                                          // 0x0108(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0110(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FText                                       Description;                                              // 0x0128(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UTexture2D*                                  IconTexture;                                              // 0x0140(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EXRarity                                           Rarity;                                                   // 0x0148(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0149(0x0007) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0150(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	int                                                MaxStackSize;                                             // 0x0170(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAutoPickup;                                              // 0x0174(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDestroyOnDrop;                                           // 0x0175(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDropOnUnequip;                                           // 0x0176(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAutoUnequip;                                             // 0x0177(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                Amount;                                                   // 0x0178(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)
	uint32_t                                           InventoryUID;                                             // 0x017C(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bInstanced;                                               // 0x0180(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0181(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XItemComponent");
		return ptr;
	}


	bool ShouldShowInInventory();
	void OnUsedInInventory();
	void OnUnequipped(const struct FGameplayTag& Slot);
	void OnRep_SourceItemClass();
	void OnRep_Amount();
	void OnRemovedFromInventory(class UXInventoryComponent* Inventory);
	void OnInventoryStackIncreased();
	void OnInventoryStackDecreased();
	void OnEquipped(const struct FGameplayTag& Slot);
	void OnBeforeAddToInventory(class UXInventoryComponent* Inventory, int AmountToAdd);
	void OnAddedToInventory(int AmountAdded);
	void K2_OnRemovedFromInventory(class UXInventoryComponent* Inventory);
	void K2_OnInventoryStackIncreased();
	void K2_OnInventoryStackDecreased();
	void K2_OnBeforeAddToInventory(class UXInventoryComponent* Inventory, int AmountToAdd);
	void K2_OnAddedToInventory(int AmountAdded);
	bool IsStackable();
	class UXInventoryComponent* GetOwnerInventory();
	class AXCharacter* GetOwnerCharacter();
	int GetNumInInventory();
	struct FGameplayTag GetCategory();
	struct FGameplayTag FindAutoUpgradeSlot(class UXInventoryComponent* DestInventory);
	bool CanUseInInventory();
	bool CanBeEquipped(class AXCharacter* Char);
	bool CanBeDropped();
	int CanAdd(int InAmount, class UXInventoryComponent* DestInventory);
};


// Class g3.GArmorItem
// 0x0008 (0x0190 - 0x0188)
class UGArmorItem : public UXItemComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0188(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GArmorItem");
		return ptr;
	}

};


// Class g3.GGameplayEffect
// 0x0008 (0x01F0 - 0x01E8)
class UGGameplayEffect : public UXGameplayEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01E8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GGameplayEffect");
		return ptr;
	}


	void BindOnPlayerArmorOvercharged(const struct FScriptDelegate& Callback);
	void BindOnPlayerArmorDamaged(const struct FScriptDelegate& Callback);
	void BindOnEnemyArmorDamaged(const struct FScriptDelegate& Callback);
};


// Class g3.GAttributeChangeEventEffect
// 0x0058 (0x0248 - 0x01F0)
class UGAttributeChangeEventEffect : public UGGameplayEffect
{
public:
	TArray<struct FXScaledEffectClass>                 AttributeChangeEffectsToApply;                            // 0x01F0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FGameplayTag                                AttributeTag;                                             // 0x0200(0x0008) (Edit, DisableEditOnInstance)
	float                                              ChangeAmount;                                             // 0x0208(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ChangeSeconds;                                            // 0x020C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPropagateEffectScale;                                    // 0x0210(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRemoveAttributeChangeEffectsOnDeactivate;                // 0x0211(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bClearTrackedChangesOnProc;                               // 0x0212(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0213(0x0005) MISSED OFFSET
	class AController*                                 Instigator;                                               // 0x0218(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FGTrackedAttributeChange>            TrackedChanges;                                           // 0x0220(0x0010) (ZeroConstructor, Transient)
	float                                              CachedDelta;                                              // 0x0230(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0234(0x0004) MISSED OFFSET
	TArray<class UXGameplayEffect*>                    AppliedEffects;                                           // 0x0238(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GAttributeChangeEventEffect");
		return ptr;
	}

};


// Class g3.GAttributeModModifierEffect
// 0x0030 (0x0218 - 0x01E8)
class UGAttributeModModifierEffect : public UXGameplayEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01E8(0x0008) MISSED OFFSET
	TArray<class UXAttributeModModifier*>              AttributeModModifiers;                                    // 0x01F0(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	bool                                               bScaleModifierEffectsByEffectScale;                       // 0x0200(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0201(0x0007) MISSED OFFSET
	TArray<class UXAttributeModModifier*>              AppliedModifiers;                                         // 0x0208(0x0010) (ExportObject, ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GAttributeModModifierEffect");
		return ptr;
	}

};


// Class g3.GAttributeTargetedDamageType
// 0x0018 (0x0058 - 0x0040)
class UGAttributeTargetedDamageType : public UDamageType
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET
	float                                              ArmorDamageScale;                                         // 0x0048(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HealthDamageScale;                                        // 0x004C(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bProcHitEffects;                                          // 0x0050(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0051(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GAttributeTargetedDamageType");
		return ptr;
	}

};


// Class g3.XActionCue
// 0x0078 (0x0390 - 0x0318)
class AXActionCue : public AActor
{
public:
	class UParticleSystem*                             FX;                                                       // 0x0318(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound;                                                    // 0x0320(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ExplosionDecal;                                           // 0x0328(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             DeactivationFX;                                           // 0x0330(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  DeactivationSound;                                        // 0x0338(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      DeactivationExplosionDecal;                               // 0x0340(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShouldInstantiate;                                       // 0x0348(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAttachToTarget;                                          // 0x0349(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EAttachLocation>                       AttachPointRule;                                          // 0x034A(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x034B(0x0005) MISSED OFFSET
	struct FName                                       AttachPointName;                                          // 0x0350(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRotationFromHitNormal;                                   // 0x0358(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0359(0x0003) MISSED OFFSET
	float                                              FadeOutTime;                                              // 0x035C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<TWeakObjectPtr<class UParticleSystemComponent>> SpawnedParticles;                                         // 0x0360(0x0010) (ExportObject, ZeroConstructor, Transient)
	TArray<TWeakObjectPtr<class UAudioComponent>>      SpawnedSounds;                                            // 0x0370(0x0010) (ExportObject, ZeroConstructor, Transient)
	TArray<TWeakObjectPtr<class AXExplosionDecalActor>> SpawnedExplosionDecals;                                   // 0x0380(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.XActionCue");
		return ptr;
	}


	void WhileActive(const struct FXActionCueParameters& Params);
	class UAudioComponent* SpawnSoundCue(class USoundBase* SoundTemplate, const struct FXActionCueParameters& Params);
	class UParticleSystemComponent* SpawnParticleSystem(class UParticleSystem* ParticleTemplate, const struct FXActionCueParameters& Params);
	class AXExplosionDecalActor* SpawnExplosionDecal(class UClass* ExplosionDecalTemplate, const struct FXActionCueParameters& Params);
	void OnDeactivated(const struct FXActionCueParameters& Params);
	void OnActivated(const struct FXActionCueParameters& Params);
	void End(const struct FXActionCueParameters& Params);
	void Begin(const struct FXActionCueParameters& Params);
};


// Class g3.GBeamCue
// 0x0010 (0x03A0 - 0x0390)
class AGBeamCue : public AXActionCue
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET
	class UClass*                                      BeamTargetPlaceholder;                                    // 0x0398(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class g3.GBeamCue");
		return ptr;
	}

};


// Class g3.XAction
// 0x00E0 (0x0108 - 0x0028)
class UXAction : public UObject
{
public:
	class UAnimMontage*                                Montage;                                                  // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpaceBase*                             AimingBlendspace;                                         // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasStance;                                               // 0x0038(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	class UAnimSequence*                               StartStanceAnim;                                          // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               HoldStanceAnim;                                           // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CancelStanceAnim;                                         // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Duration;                                                 // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCustomDuration;                                          // 0x005C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
	struct FXActionRelativeTime                        NeutralRecoveryTime;                                      // 0x0060(0x0010) (Edit, DisableEditOnInstance)
	TArray<struct FXActionPhase>                       Phases;                                                   // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UXActionTrigger*>                     Triggers;                                                 // 0x0080(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance)
	class UXActionTransistor*                          DefaultTransistor;                                        // 0x0090(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	struct FGameplayTagContainer                       Tags;                                                     // 0x0098(0x0020) (Edit, DisableEditOnInstance)
	TArray<struct FXActionTaggedPeriod>                TaggedPeriods;                                            // 0x00B8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
